app/controllers/api/v1/books_controller.rb

  def load_book
    @book = Book.find_by id: params[:id]
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]