app/controllers/api/v1/reviews_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  def load_book
    @book = Book.find_by id: params[:book_id]

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def load_review
    @review = Review.find_by id: params[:id]