app/controllers/api/v1/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "mona@yahoo.com"], ["LIMIT", 1]]
---
  def load_user
    @user = User.find_for_database_authentication email: sign_in_params[:email]

SELECT  "users".* FROM "users" WHERE "users"."authentication_token" = $1 LIMIT $2  [["authentication_token", "83Yzy8Add8H5tkS9_LP7"], ["LIMIT", 1]]
---
  def valid_token
    @user = User.find_by authentication_token: request.headers["AUTH-TOKEN"]